                                chapter6 Data Loading, Storage, and File Format

# 6.1 Reading and Writing Data in text format

In [14]:
!cat /Users/yuxichen/"online eduction"/python_data_analysis/pydata-book-3rd-edition/examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
import pandas as pd

In [19]:
import numpy as np

In [17]:
df = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex1.csv")

In [18]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
!cat /Users/yuxichen/"online eduction"/python_data_analysis/pydata-book-3rd-edition/examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [22]:
df = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex1.csv", 
                 header=None)

In [23]:
df

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [25]:
pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex1.csv", 
                 names = ["a","b","c","d","message"])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [31]:
 names = ["a","b","c","d","message"]

In [33]:
pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex1.csv", 
            names = names, index_col = "message")

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [34]:
!cat /Users/yuxichen/"online eduction"/python_data_analysis/pydata-book-3rd-edition/examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [36]:
result = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex3.txt"
                     ,sep = "\s+")

In [37]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [38]:
!cat /Users/yuxichen/"online eduction"/python_data_analysis/pydata-book-3rd-edition/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [39]:
result = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex4.csv",
                    skiprows = [0,2,3])

In [40]:
result

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [41]:
!cat /Users/yuxichen/"online eduction"/python_data_analysis/pydata-book-3rd-edition/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [44]:
result = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex5.csv",
                    )

In [45]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

## Reading Text Files in Pieces

In [48]:
pd.options.display.max_rows = 10

In [49]:
result = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex6.csv",
                    )

In [50]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [51]:
result = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex6.csv",
                    nrows=5)

In [52]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [77]:
chunker = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex6.csv", chunksize=1000)

tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

## Writing Data to Text Format

In [80]:
data = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex5.csv",
                    )

In [81]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [82]:
data.to_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex5_out.csv")

In [83]:
!cat "/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex5_out.csv"

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [84]:
import sys

In [85]:
data.to_csv(sys.stdout)

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [86]:
data.to_csv(sys.stdout,sep = "|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [87]:
data.to_csv(sys.stdout, na_rep = "NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [88]:
data.to_csv(sys.stdout, na_rep = "NULL", index=False, header=False)

one,1,2,3.0,4,NULL
two,5,6,NULL,8,world
three,9,10,11.0,12,foo

In [89]:
data.to_csv(sys.stdout, na_rep = "NULL", index=False)

something,a,b,c,d,message
one,1,2,3.0,4,NULL
two,5,6,NULL,8,world
three,9,10,11.0,12,foo

## Working with Other delimited Format

In [93]:
!cat "/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex7.csv"

"a","b","c"
"1","2","3"
"1","2","3"

In [94]:
import csv

In [195]:
f = open("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex7.csv")

In [96]:
reader = csv.reader(f)

In [97]:
reader

In [98]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [99]:
f.close()

In [147]:
with open("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [102]:
header, values = [lines[0], lines[1:]]

In [121]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [122]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [115]:
header

['a', 'b', 'c']

In [136]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [141]:
data = zip(*values)

In [142]:
print(tuple(data))

(('1', '1'), ('2', '2'), ('3', '3'))

In [188]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

reader = csv.reader(f, dialect=my_dialect)

In [189]:
print(reader)

<_csv.reader object at 0x7f92e8e7acf0>

In [190]:
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [196]:
reader = csv.reader(f, delimiter = "|")

In [197]:
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

## JSON Data

In [201]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [202]:
import json

In [203]:
result = json.loads(obj)

In [204]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [205]:
result?

In [206]:
asjson = json.dumps(result)

In [207]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [208]:
type(asjson)

str

In [209]:
data = pd.read_json("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/example.json")

In [210]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [211]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [212]:
type(data.to_json(sys.stdout))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

NoneType

## XML and HTML: Web Scrapping

In [217]:
tables = pd.read_html("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/fdic_failed_bank_list.html")

In [218]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [219]:
len(tables)

1

In [223]:
failures = tables[0]

In [224]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

# 6.2 Binary Data Formats

In [230]:
frame = pd.read_csv("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex1.csv")

In [231]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [232]:
frame.to_pickle("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/frame_pickle")

In [233]:
pd.read_pickle("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## Reading Mcrosoft Excel Files

In [237]:
xlsx = pd.ExcelFile("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex1.xlsx")

In [238]:
xlsx

In [239]:
xlsx.sheet_names

['Sheet1']

In [241]:
xlsx.parse(sheet_name = "Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [242]:
xlsx.parse(sheet_name = "Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [243]:
frame = pd.read_excel("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex1.xlsx")

In [244]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [245]:
writer = pd.ExcelWriter("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex2.xlsx")

In [246]:
writer

In [247]:
frame.to_excel(writer,"sheet1")

In [248]:
writer.save()

In [249]:
frame.to_excel("/Users/yuxichen/online eduction/python_data_analysis/pydata-book-3rd-edition/examples/ex2.xlsx")